# *Schema*: *Schem*e interpreter in Scal*a*3

Currently, schema can evaluate trivial recursive programs as shown below:

```
schema> (define fact (lambda (n) (if (= n 0) 1 (* n (fact (- n 1))))))
null
schema> (fact 10)
Num(3628800)
schema> (define is-even (lambda (n) (if (= n 0) #t (is-odd (- n 1)))))
null
schema> (define is-odd (lambda (n) (if (= n 0) #f (is-even (- n 1)))))
null
schema> (is-even 88)
Bool(true)
```

The current status of this project is work in progress:

- [x] Lexer
- [ ] Parser
  - [x] Basic parsing
  - [x] Trivial definition
  - [ ] Complex definition
  - [ ] Derived expression (special forms)
- [ ] Domain
  - [x] basic syntax
  - [x] basic semantics
  - [x] Mutable environment
  - [ ] syntax.Definition, etc.
- [x] Basic eval
- [ ] Advanced eval

> Below is information generated by sbt.
> 
> ## sbt project compiled with Scala 3
> 
> ### Usage
> 
> This is a normal sbt project. You can compile code with `sbt compile`, run it with `sbt run`, and `sbt console` will start a Scala 3 REPL.

> For more information on the sbt-dotty plugin, see the
> [scala3-example-project](https://github.com/scala/scala3-example-project/blob/main/README.md).
